:PROPERTIES:
:ID:       75CF62BB-B268-47AD-8528-98AE386B0554
:END:
#+title: Org-mode mapping API
#+date: 2021-05-11 15:46 PM
#+updated: 2021-05-11 16:30 PM
#+filetags: :org_mode:emacs:

* org-map-entries
** Counting entries (headlines)
   This is probably the most basic use case for this. I needed in [[id:33D6368F-C063-40E0-8369-9FA8954C8A46][publish.org]] to
   count the number of headlines. I add a table of contents export option only
   when there are more than 3 headlines in an org note.

   Get the number of headlines 
   #+begin_src emacs-lisp
     (length (org-map-entries t))
   #+end_src

   #+RESULTS:
   : 3
** Resources
   See [[https://orgmode.org/manual/Using-the-Mapping-API.html][Using the Mapping API docs]].
